(deftemplate симптомы
    (slot ухудшение-самочувствие (type SYMBOL))
    (slot температура-тела (type SYMBOL))
    (slot интоксикация (type SYMBOL))
    (slot насморк-заложенность-носа (type SYMBOL))
    (slot чихание (type SYMBOL))
    (slot боль-в-горле-покраснение (type SYMBOL))
    (slot головная-боль (type SYMBOL))
    (slot утомляемость (type SYMBOL))
    (slot бессонница (type SYMBOL))
)

(defrule орви
    (симптомы (и (или (сильная-головная-боль да) (ухудшение-самочувствие быстрое да))
               (или (насморк-заложенность-носа да) (температура-тела 37-38 да)))
               (или (боль-в-горле-покраснение кашель да) (головная-боль при-осложнениях да) (утомляемость может-быть да)))
    =>
    (printout t "Человек может болеть ОРВИ" crlf)
)

(defrule грипп
    (симптомы (и (ухудшение-самочувствие внезапное да)
               (и (повышенная-температура-тела 39-40 да) (интоксикация-озноб-головная-боль-светобоязнь да))
               (или (насморк-заложенность-носа да) (чихание да) (боль-в-горле-покраснение-на-вторые-сутки да)))
               (или (головная-боль сильная да) (утомляемость сохранятся-после-болезни да) (бессонница сохраняется-в-течение-2-3-недель да)))
    =>
    (printout t "У человека мог быть грипп" crlf)
)

(defrule неизвестно
    =>
    (printout t "Недостаточно симптомов для точного определения" crlf)
)
